/*
给定m行n列的图像各像素点的灰度值，要求用如下方法对其进行处理：
1.四周最外侧的像素点灰度值不变；
2.中间各像素点新灰度值为该像素点及其上下左右相邻四个像素点原灰度值的平均(舍入到最接近的整数)。

本题评测过程如果遇有格式错误，但是结果正确，可以忽略格式错误。

第一行包含两个整数m和n，表示图像包含像素点的行数和列数。1≤m≤100，1≤n≤100。接下来m行，每行n个整数，表示图像的每个像素点灰度。
相邻两个整数之间用单个空格隔开，每个元素均在0~255之间 。

【输入样例】
4 5
100 0 100 0 50
50 100 200 0 0
50 50 100 100 200
100 100 50 50 100

【输出样例】
100 0 100 0 50
50 80 100 60 0
50 80 100 90 200
100 100 50 50 100

*/

#include <stdio.h>

int main()
{
    int m, n;
    scanf("%d %d", &m, &n);

    int matrix_0[100][100], matrix_after[100][100];

    // 输入原始矩阵；
    int i, j;
    for (i = 0; i < m; i++)
    {
        for (j = 0; j < n; j++)
        {
            scanf("%d", &matrix_0[i][j]);
        }
    }

    // 按规则计算，round报错，改为 + 2.5；
    for (i = 0; i < m; i++)
    {
        for (j = 0; j < n; j++)
        {
            if (i == 0 || j == 0 || i == m - 1 || j == n - 1)
            {
                matrix_after[i][j] = matrix_0[i][j];
            }
            else
            {
                matrix_after[i][j] = (matrix_0[i][j] + matrix_0[i - 1][j] + matrix_0[i + 1][j] + matrix_0[i][j - 1] + matrix_0[i][j + 1] + 2.5) / 5; // 加2.5是为了四舍五入
            }
        }
    }

    // 双重循环输出结果；
    for (i = 0; i < m; i++)
    {
        for (j = 0; j < n; j++)
        {
            printf("%d", matrix_after[i][j]);
            if (j != n - 1)
            {
                printf(" ");
            }
        }
        printf("\n");
    }

    return 0;
}
